![01](01.png)

https://data.seoul.go.kr/
### 서울시 청소년 정신건강 통계

In [6]:
import pandas as pd

In [7]:
dates = pd.date_range('20190301', periods = 6)

In [8]:
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
import numpy as np

In [10]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['A', 'B', 'C', 'D'])

In [11]:
df

                   A         B         C         D
2019-03-01 -0.269541 -0.368149 -1.110770  0.016233
2019-03-02 -0.160248  0.239577 -0.031435  1.184636
2019-03-03 -0.359648  0.871243  0.204139 -0.836813
2019-03-04 -0.341473 -0.825769  0.116483 -0.708801
2019-03-05  1.997129  0.991951  0.242911  0.925846
2019-03-06 -1.361861  0.229540 -0.528811 -0.323821

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.values

array([[-0.26954096, -0.36814891, -1.11077009,  0.01623259],
       [-0.16024819,  0.23957682, -0.03143548,  1.18463641],
       [-0.35964828,  0.8712431 ,  0.20413884, -0.83681285],
       [-0.34147285, -0.82576908,  0.11648294, -0.70880118],
       [ 1.99712924,  0.99195063,  0.24291146,  0.92584613],
       [-1.36186095,  0.22953965, -0.52881137, -0.32382053]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.082607  0.189732 -0.184581  0.042880
std    1.108741  0.700650  0.533717  0.843481
min   -1.361861 -0.825769 -1.110770 -0.836813
25%   -0.355104 -0.218727 -0.404467 -0.612556
50%   -0.305507  0.234558  0.042524 -0.153794
75%   -0.187571  0.713327  0.182225  0.698443
max    1.997129  0.991951  0.242911  1.184636

In [17]:
df.sort_values(by = 'A')

                   A         B         C         D
2019-03-06 -1.361861  0.229540 -0.528811 -0.323821
2019-03-03 -0.359648  0.871243  0.204139 -0.836813
2019-03-04 -0.341473 -0.825769  0.116483 -0.708801
2019-03-01 -0.269541 -0.368149 -1.110770  0.016233
2019-03-02 -0.160248  0.239577 -0.031435  1.184636
2019-03-05  1.997129  0.991951  0.242911  0.925846

In [18]:
df.sort_values(by = 'A', ascending = False)

                   A         B         C         D
2019-03-05  1.997129  0.991951  0.242911  0.925846
2019-03-02 -0.160248  0.239577 -0.031435  1.184636
2019-03-01 -0.269541 -0.368149 -1.110770  0.016233
2019-03-04 -0.341473 -0.825769  0.116483 -0.708801
2019-03-03 -0.359648  0.871243  0.204139 -0.836813
2019-03-06 -1.361861  0.229540 -0.528811 -0.323821

In [19]:
df['A']

2019-03-01   -0.269541
2019-03-02   -0.160248
2019-03-03   -0.359648
2019-03-04   -0.341473
2019-03-05    1.997129
2019-03-06   -1.361861
Freq: D, Name: A, dtype: float64

In [20]:
type(df['A'])

pandas.core.series.Series

In [21]:
df[0:3]

                   A         B         C         D
2019-03-01 -0.269541 -0.368149 -1.110770  0.016233
2019-03-02 -0.160248  0.239577 -0.031435  1.184636
2019-03-03 -0.359648  0.871243  0.204139 -0.836813

In [22]:
df.loc['2019-03-01']

A   -0.269541
B   -0.368149
C   -1.110770
D    0.016233
Name: 2019-03-01 00:00:00, dtype: float64

In [23]:
df.loc['2019-03-01', 'A']

-0.26954096301920616

In [24]:
df.loc['2019-03-01', ['A','B']]

A   -0.269541
B   -0.368149
Name: 2019-03-01 00:00:00, dtype: float64

In [25]:
df.loc['2019-03-01' : '2019-03-02', ['A','B']]

                   A         B
2019-03-01 -0.269541 -0.368149
2019-03-02 -0.160248  0.239577

In [26]:
df.loc[:, ['A','B']]

                   A         B
2019-03-01 -0.269541 -0.368149
2019-03-02 -0.160248  0.239577
2019-03-03 -0.359648  0.871243
2019-03-04 -0.341473 -0.825769
2019-03-05  1.997129  0.991951
2019-03-06 -1.361861  0.229540

In [27]:
df.iloc[0:2]

                   A         B         C         D
2019-03-01 -0.269541 -0.368149 -1.110770  0.016233
2019-03-02 -0.160248  0.239577 -0.031435  1.184636

In [28]:
df.iloc[0:2,0:2]

                   A         B
2019-03-01 -0.269541 -0.368149
2019-03-02 -0.160248  0.239577

In [29]:
df.iloc[[0,1,2],0:2]

                   A         B
2019-03-01 -0.269541 -0.368149
2019-03-02 -0.160248  0.239577
2019-03-03 -0.359648  0.871243

In [30]:
df['A'] > 0

2019-03-01    False
2019-03-02    False
2019-03-03    False
2019-03-04    False
2019-03-05     True
2019-03-06    False
Freq: D, Name: A, dtype: bool

In [31]:
df[df['A'] > 0]

                   A         B         C         D
2019-03-05  1.997129  0.991951  0.242911  0.925846

In [32]:
df > 0

                A      B      C      D
2019-03-01  False  False  False   True
2019-03-02  False   True  False   True
2019-03-03  False   True   True  False
2019-03-04  False  False   True  False
2019-03-05   True   True   True   True
2019-03-06  False   True  False  False

In [33]:
df[df > 0]

                   A         B         C         D
2019-03-01       NaN       NaN       NaN  0.016233
2019-03-02       NaN  0.239577       NaN  1.184636
2019-03-03       NaN  0.871243  0.204139       NaN
2019-03-04       NaN       NaN  0.116483       NaN
2019-03-05  1.997129  0.991951  0.242911  0.925846
2019-03-06       NaN  0.229540       NaN       NaN

In [34]:
df2 = pd.DataFrame(df, columns = ['A', 'C', 'D', 'B'])
df2

                   A         C         D         B
2019-03-01 -0.269541 -1.110770  0.016233 -0.368149
2019-03-02 -0.160248 -0.031435  1.184636  0.239577
2019-03-03 -0.359648  0.204139 -0.836813  0.871243
2019-03-04 -0.341473  0.116483 -0.708801 -0.825769
2019-03-05  1.997129  0.242911  0.925846  0.991951
2019-03-06 -1.361861 -0.528811 -0.323821  0.229540

In [35]:
df['E'] = np.nan
df

                   A         B         C         D   E
2019-03-01 -0.269541 -0.368149 -1.110770  0.016233 NaN
2019-03-02 -0.160248  0.239577 -0.031435  1.184636 NaN
2019-03-03 -0.359648  0.871243  0.204139 -0.836813 NaN
2019-03-04 -0.341473 -0.825769  0.116483 -0.708801 NaN
2019-03-05  1.997129  0.991951  0.242911  0.925846 NaN
2019-03-06 -1.361861  0.229540 -0.528811 -0.323821 NaN

In [36]:
df.loc['2019-03-02', 'E'] = 2
df

                   A         B         C         D    E
2019-03-01 -0.269541 -0.368149 -1.110770  0.016233  NaN
2019-03-02 -0.160248  0.239577 -0.031435  1.184636  2.0
2019-03-03 -0.359648  0.871243  0.204139 -0.836813  NaN
2019-03-04 -0.341473 -0.825769  0.116483 -0.708801  NaN
2019-03-05  1.997129  0.991951  0.242911  0.925846  NaN
2019-03-06 -1.361861  0.229540 -0.528811 -0.323821  NaN

In [37]:
df['F'] = df['A'] + df['B']
df

                   A         B         C         D    E         F
2019-03-01 -0.269541 -0.368149 -1.110770  0.016233  NaN -0.637690
2019-03-02 -0.160248  0.239577 -0.031435  1.184636  2.0  0.079329
2019-03-03 -0.359648  0.871243  0.204139 -0.836813  NaN  0.511595
2019-03-04 -0.341473 -0.825769  0.116483 -0.708801  NaN -1.167242
2019-03-05  1.997129  0.991951  0.242911  0.925846  NaN  2.989080
2019-03-06 -1.361861  0.229540 -0.528811 -0.323821  NaN -1.132321

In [38]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\user\anaconda3\lib\site-packages (2.0.1)

In [39]:
pd.read_excel("./data/teen.xls")

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2020,구분,35.1,29.8,40.8,25.4,21.2,29.9,11.2,8.8,13.8

In [40]:
pd.read_excel("./data/teen.xls", header = 1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2020  구분  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [41]:
pd.read_excel("./data/teen.xls", header = 1, usecols = "C:K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [42]:
col_names = ['스트레스', '스트레스남학생', '스트레스여학생', '우울감경험율', '우울남학생', '우울여학생', '자살생각율', '자살남학생', '자살여학생']
pd.read_excel("./data/teen.xls", header = 1, usecols = "C:K", names = col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [43]:
raw_data = pd.read_excel("./data/teen.xls", header = 1, usecols = "C:K", names = col_names)
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [44]:
raw_data.loc[1] = 100 - raw_data.loc[0]
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
1  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2

In [45]:
raw_data.rename(index = {0:"그렇다", 1:"아니다"})

     스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
그렇다  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
아니다  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2

In [46]:
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
1  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2

In [48]:
raw_data['응답'] = ['그렇다', '아니다']
raw_data.set_index('응답', drop = True, inplace = True)

In [49]:
raw_data

     스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
응답
그렇다  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
아니다  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2